console.log('Lesson-1 JS');

//? Створити змінну з іменем age і присвоїти їй значення свого віку.
//?  Вивести значення цієї змінної в консоль.

//! Код виконаного завдання

const age = 16;
console.log(age);


//? Створити змінну з іменем name і присвоїти їй значення свого імені.
//? Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const myName = "Myroslav";
console.log(myName);


//? Створити змінну з іменем isStudent і присвоїти їй значення true або false,
//? залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const isStudent = true;
console.log("я студент?:", isStudent);

//? Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
//? Вивести цей рядок в консоль.

//! Код виконаного завдання
const myString = "Переможця ніхто не спитає, правду він говорив чи ні."
console.log(myString);

//? Створити змінну з іменем myNumber і присвоїти їй довільне числове значення.
//? Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

//! Код виконаного завдання
let myNumber = 42;
myNumber = myNumber + 10;
console.log(myNumber);
console.log('myNumber:', myNumber);

//? Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
const myNull = null;
console.log(myNull);

//? Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt().
//? Після введення імені вивести повідомлення привітання з використанням введеного імені.

//! Код виконаного завдання
const userName = prompt("Будь ласка, введіть ваше ім'я:");
if (userName) { 
    alert(`Привіт, ${userName}!`);
}


//? Створити скрипт який виводить спливаюче підтвердження за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

//! Код виконаного завдання
let isComing = confirm("Підвердіть покупку футболки");
console.log('Дякую за підтвердження!:', isComing);
isComing = confirm("Підвердіть покупку футболки");
console.log('Дію відмінено!:', isComing);

//? Створити скрипт який виводить спливаюче попередження за допомогою alert().
//? Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!"

//! Код виконаного завдання
alert("Увага! Ця дія може бути небезпечною.");
let userConfirmation = confirm("Ви дійсно хочете продовжити?");
console.log('userConfirmation:', userConfirmation);
if (Boolean(userConfirmation)) {
    alert("Дякую за підтвердження!");
} else {
    alert("Дію відмінено!");
}