//! Відкладене завантаження (з loading="lazy")
console.warn('Відкладене завантаження (з loading="lazy"):');
//? ✴️ Відкладене завантаження (lazy-loading)
//? - це прийом, який відкладає завантаження
//? некритичних ресурсів під час завантаження сторінки.
//? Замість цього, ці некритичні ресурси завантажуються
//? лише у разі потреби.
//? Це знижує початкову вагу ресурсів,
//? які необхідно завантажити для відображення сторінки,
//? використання системних ресурсів
//? підвищує час її завантаження та наступного рендеру.
//? Все це позитивно позначається на продуктивності.
//?     📌 На на практиці ледаче завантаження виглядає приблизно так:
//? 🔸 Ви потрапляєте на сторінку і починаєте прокручувати її, читаючи вміст.
//? 🔸 У якийсь момент ви прокручуєте сторінку до зображення - заглушки.
//? 🔸 Зображення - заглушка раптово змінюється на справжнє зображення.


//! Атрибут loading
//? ✴️ Сучасні браузери вміють робити це
//? без JavaScript, але, на жаль, не всі.
//? HTML-атрибут loading тегу <img> підтримується нативно
//? у всіх сучасних браузерах, крім, можливо, Safari,
//? і дозволяє браузеру відкласти завантаження зображень
//? за кадром доти, доки користувач не прокрутить до них сторінку.
//?     📌 Підтримує три значення:
//? 🔸 "lazy" - браузер виконає відкладене завантаження зображення.
//? 🔸 "eager" - зображення буде завантажене за першої нагоди,
//?    тобто без відкладеного завантаження.
//? 🔸 "auto" (значення за замовчуванням) - браузер сам визначає
//?    чи виконувати відкладене завантаження чи ні.
console.log(
    `%c
    <img
        src="./my-image.jpg"
        alt="Image description"
        loading="lazy"
    />
    `,
    'color: blue; font-size: 18px',
);
//? ✳️ У вкладці Network в інструментах розробника
//? виберіть фільтр Img, щоб відображалось лише завантаження зображень.
//? Після цього прокручуйте приклад і спостерігайте
//? як будуть довантажуватися закадрові зображення котів.
//? Браузери, що підтримують атрибут loading,
//? будуть завантажувати зображення відкладено,
//? а браузери без підтримки - завантажать усі зображення відразу.
console.log("-------------------------------------------------------------------");
//! Простий приклад використання Intersection Observer
console.warn("Простий приклад використання Intersection Observer:");
const target = document.getElementById("target");
const scrollContainer = document.getElementById("scrollContainer");
console.log("scrollContainer:", scrollContainer); //!

const observer = new IntersectionObserver(
    (entries) => {
        entries.forEach(entry => {
            if (entry.isIntersecting) {
                console.log("Елемент видно!");
                target.style.background = "lightgreen";
            } else {
                console.log("Елемент пішов із зони видимості...");
                target.style.background = "yellow";
            }
        }
        );
    },
    {
        root: null,
        // root: scrollContainer, //! ВІДКРИТИ (і в CSS) для демонстрації відстеження "box-target" у вікні [scrollContainer]
        threshold: 0.5, //todo: Викликається, коли 50% об'єкта видно
        // threshold: [0, 0.25, 0.5, 0.75, 1], ////todo: Перерахунок перетину root кожної чверті видимості.
        //! ПРИХОВАТИ (і в CSS) для демонстрації відстеження "box-target" у вікні [scrollContainer]
        rootMargin: '0px 0px -50% 0px'  //todo: Знизу зменшили зону на 50% висоти в'юпорту
    }
);

console.log("observer:", observer); //!

observer.observe(target); //todo: Додає елемент до списку відслідковуваних елементів
