//todo: Завдання-1 (task-1)
//* Порівняння кількох промісів
//? Ви маєте набір функцій, які повертають проміси
//? з випадковими затримками.
//? Ваше завдання — виконати всі проміси одночасно
//? за допомогою Promise.all і обробити результати.

//? 🔸 Створіть функцію delayedPromise, яка приймає значення
//?    і затримку (у мілісекундах) і повертає проміс,
//?    який вирішується з заданим значенням після затримки.
//? 🔸 Створіть масив з 5 промісів, використовуючи
//?    функцію delayedPromise, із різними значеннями та затримками.
//? 🔸 Використайте Promise.all, щоб одночасно виконати всі проміси з масиву.
//? 🔸 Обробіть результати вирішення промісів та виведіть їх у консоль.
//! Код виконаного завдання
//todo: Завдання-1 (task-1)
//* Порівняння кількох промісів

//? Функція яка повертає проміс із затримкою
setTimeout(()=>{
function delayedPromise(value, delay) {
  return new Promise((resolve) => {
    setTimeout(() => {
      resolve(value);
    }, delay);
  });
}

//? Масив із 5 промісів
const promises = [
  delayedPromise("Проміс 1", 1000),
  delayedPromise("Проміс 2", 2000),
  delayedPromise("Проміс 3", 1500),
  delayedPromise("Проміс 4", 3000),
  delayedPromise("Проміс 5", 2500),
];

//? Виконуємо всі проміси одночасно
Promise.all(promises)
  .then((results) => {
    console.log("Результати всіх промісів:");
    console.log(results);
  })
  .catch((error) => {
    console.log("Помилка:", error);
  })
  .finally(() => {
    console.log("Всі проміси завершили роботу");
  });
})


  //todo: Завдання-2 (task-2)
//* Змагання промісів
//? Ви маєте набір функцій, які повертають проміси
//? з випадковими затримками.
//? Ваше завдання — виконати всі проміси одночасно
//? за допомогою Promise.race
//? і отримати результат найшвидшого проміса.

//? 🔸 Створіть функцію randomDelay, яка приймає значення
//?    і повертає проміс з випадковою затримкою (від 1000 до 5000 мілісекунд).
//? 🔸 Створіть масив з 5 промісів, використовуючи функцію
//?    randomDelay, із різними значеннями.
//? 🔸 Використайте Promise.race, щоб виконати всі проміси з масиву
//?    і отримати результат найшвидшого проміса.
//? 🔸 Обробіть результат найшвидшого проміса та виведіть його у консоль.
//! Код виконаного завдання
//todo: Завдання-2 (task-2)
//* Змагання промісів

//? Функція з випадковою затримкою
setTimeout(()=>{
  function randomDelay(value) {
  const delay = Math.floor(Math.random() * 4000) + 1000;

  return new Promise((resolve) => {
    setTimeout(() => {
      resolve(value);
    }, delay);
  });
}

//? Масив із 5 промісів
const racePromises = [
  randomDelay("Проміс A"),
  randomDelay("Проміс B"),
  randomDelay("Проміс C"),
  randomDelay("Проміс D"),
  randomDelay("Проміс E"),
];

//? Отримуємо результат найшвидшого
Promise.race(racePromises)
  .then((result) => {
    console.log("Найшвидший проміс:", result);
  })
  .catch((error) => {
    console.log("Помилка:", error);
  })
  .finally(() => {
    console.log("Змагання завершено");
  });
},3000);

