//! Пагінація
//? ✳️ База даних може зберігати колекції,
//? що містять сотні мільйонів записів.
//? Тому повертати всю колекцію на кожен
//? GET-запит - занадто ресурсозатратно.
//? Розмір тіла відповіді буде занадто великий,
//? і час запиту затягнеться на десятки секунд,
//? або навіть хвилини - чим більше даних
//? у відповіді від бекенду,
//? тим довше вона передається мережею.

//? ✳️ До того ж, необхідно думати про користувачів
//? - навряд чи їм потрібні усі мільйони записів відразу.
//? Обробка такої великої кількості даних у відповіді
//? і відображення інтерфейсу потребує величезних
//? ресурсів пристрою, на якому переглядається веб-сторінка.
//? За статистикою, користувачі знаходять цікаву
//? для них інформацію на декількох перших екранах.

//? ✴️ Припустимо наш бекенд my-api.com зберігає 
//? дуже велику колекцію постів у ресурсі /posts, 
//? яку зобразимо дванадцятьма елементами на ілюстрації.
console.warn(`Вся колекція: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_17/images/no-pagination.png"}`);
//? ✴️ На кожен GET-запит бекенду доведеться повернути
//? всю колекцію, і ми зіткнемося з проблемами,
//? описаними раніше.

//? ✴️ Для їх вирішення існує ПАГІНАЦІЯ - прийом, 
//? за яким, на перший і кожен наступний GET-запит 
//? повертається не вся колекція, а певна її частина. 
//? Пагінація реалізується на бекенді і використовується 
//? на фронтенді за допомогою спеціальних параметрів запиту.
console.log("--------------------------------------------------------------");
//! пошук довжини колекції 
const aray1 = [5,7,9,15,16]
const aray2 = [25,27,29,215,216,156,220]
const aray3 = [35,37,39]
function totalArrayElements(arr){
    console.log("arr:", arr);
    const finalArray = arr.length;
    console.log("finalArray:", finalArray);
return arr.length;
};

console.log(totalArrayElements(aray1));
console.log(totalArrayElements(aray2));
console.log(totalArrayElements(aray3));

//!робимо пагінацію 
const BaseURL = "https://jsonplaceholder.typicode.com/";
const EndPoints = "posts";
const perPage = 4;
const page = 10 ;
//!GET /posts?_page=1&_limit=25 - приклад запиту з урахуванням номера сторінки та кількості елементів на сторінці 
const params ={
    я
}