//todo [1]
console.log(
    "%c [1] ",
    "color: yellow; background-color: #2274A5",
);
//? Використовуючи метод взаємодії з користувачем 
//? для отимання даних з полем введення, 
//? отримайте від користувача за допомогою цих двох полів будь які дані
//? та перевірте, чи обидва поля містять значення.
//? Якщо так ✅, то виведіть повідомлення: "✅ Обидва поля заповнені, дякуємо.",
//? якщо ні ❌, то виведіть повідомлення: "❌ Не всі поля заповнені!☹️".
//? ⚠️ Додатково треба зробити такі перевіркі отиманих даних:
//? - на значення null,
//? - на пустий рядок "",
//? - на рядок в якому є лише пробіл(и)
//? та вивести відповідне повідомлення з помилкою, 
//? якщо введені дані не пройшли перевірку.
//! Код виконаного завдання
// const field1 = prompt("Введіть значення 1");
// const field2 = prompt("Введіть значення 2");
// console.log("field1:", field1);
// console.log("field2:", field2);
// if(field1 === null || field2 === null){
//     console.log("❌ Ви скасували введення");
//      alert("❌ Ви скасували введення");
// } else if(field1.trim() === "" || field2.trim() === ""){
//      console.log("❌ Ви ввели порожні значення☹️");
//       alert("❌ Ви ввели порожні значення☹️");
// } else if (field1 && field2) {
//     console.log("✅ Обидва поля заповнені, дякуємо.");
//     alert("✅ Обидва поля заповнені, дякуємо.");
// }
console.log("кінець завдання 1")

//todo [2]
console.log(
    "%c [2] ",
    "color: yellow; background-color: #2274A5",
);
//? Використовуючи метод взаємодії з користувачем 
//? для отимання даних з полем введення, отримайте від користувача
//? за допомогою цих двох полів будь які ЧИСЛОВІ дані
//? та перевірте, чи сума цих двох ЧИСЕЛ більша за 10.
//? Якщо так ✅, то виведіть повідомлення: "✅ Сума більша за 10",
//? якщо ні ❌, то виведіть повідомлення: "❌ Сума менша або дорівнює 10".
//? ⚠️ Додатково треба зробити такі перевіркі отиманих даних:
//? - на значення null,
//? - на пустий рядок "",
//? - на рядок в якому є лише пробіл(и),
//? - на число
//? та вивести відповідне повідомлення з помилкою, 
//? якщо введені дані не пройшли перевірку.
//! Код виконаного завдання
//todo var.1
// const field3 = prompt("Введіть перше число");
// const field4 = prompt("Введіть друге число");
// console.log("field3:", field3);
//  console.log("field4:", field4);
//  console.log("isNan(field3):", isNaN(field4));
//  console.log("isNan(field4):", isNaN(field4));
// if(field3 === null || field4 === null){
//     console.log("❌ Ви скасували введення");
//      alert("❌ Ви скасували введення");
// } else if(field3.trim() === "" || field4.trim() === ""){
//      console.log("❌ Ви ввели порожні значення☹️");
//       alert("❌ Ви ввели порожні значення☹️");
// }  else if (isNaN(field3) || isNaN(field4)){
//     console.log("❌ Потрібно вводити числа!");
//     alert("❌ Потрібно вводити числа!");
// } else if (field3 && field4) {
//     console.log("✅ Ви ввели числа, дякуємо.");
//     alert("✅ Ви ввели числа, дякуємо.");
// }

//todo var.2
// const field3 = prompt("Введіть перше число")?.trim();
// const field4 = prompt("Введіть друге число")?.trim();
// console.log("field3:", field3);
//  console.log("field4:", field4);
//  console.log("isNan(field3):", isNaN(field4));
//  console.log("isNan(field4):", isNaN(field4));
// if (field3 === undefined || field4 === undefined) {
//     console.log("❌ Введення скасовано!");
//     alert("❌ Введення скасовано!");
// } else if (field3 === "" || field4 === "" || isNaN(field3) || isNaN(field4)) {
//     console.log("❌ Потрібно вводити числа!");
//     alert("❌ Потрібно вводити числа!");
// }  else {
//          console.log("✅ Ви ввели числа, дякуємо.");
//          alert("✅ Ви ввели числа, дякуємо.");
//          console.log("Number(field3):", Number(field3));
//          console.log("Number(field4):", Number(field4));
//          const num1 = Number(field3);
//          const num2 = Number(field4);
//          const sum = num1 + num2;
//          if( sum > 10){
//             console.log("✅ Сума більша за 10.");
//             alert("✅ Сума більша за 10.");
//          } else{
//             console.log("❌ Сума менша або дорівнює 10.");
//             alert("❌ Сума менша або дорівнює 10.");
//          }

//      } 


console.log("кінець завдання 2")
console.log("---------------------------------------------");



//todo [3]
console.log(
    "%c [3] ",
    "color: yellow; background-color: #2274A5",
);
//? Використовуючи метод взаємодії з користувачем 
//? для отимання даних з полем введення, отримайте від користувача
//? за допомогою цього поля будь які дані у змінну <userText>
//? та перевірте, чи міститять отримані дані слово "JavaScript".
//? Якщо так ✅, то виведіть повідомлення: "✅ Текст <userText> містить слово JavaScript",
//? якщо ні ❌, то виведіть повідомлення: "❌Текст <userText> НЕ містить слово JavaScript".
//? ⚠️ Додатково треба зробити такі перевіркі отиманих даних:
//? - на значення null,
//? - на пустий рядок "",
//? - на рядок в якому є лише пробіл(и),
//? та вивести відповідне повідомлення з помилкою, 
//? якщо введені дані не пройшли перевірку.
//! Код виконаного завдання
// const userText = prompt("Введіть текст:")?.trim();
// console.log("userText:", userText)
// if (userText === undefined){
//     console.log("❌ Ви скасували введення.");
//     alert("❌ Ви скасували введення.");
// } else if (userText === ""){
//     console.log("❌ Ви ввели порожній рядок або лише пробіли.");
//     alert("❌ Ви ввели порожній рядок або лише пробіли.")
// } else if (userText.includes("JavaScript")){
//     console.log(`✅ Текст "${userText}" містить слово JavaScript`);
//     alert(`✅ Текст "${userText}" містить слово JavaScript`);
// } else {
//     console.log(`❌ Текст "${userText}" НЕ містить слово JavaScript`);
//     alert(`❌ Текст "${userText}" НЕ містить слово JavaScript`);
// }

console.log("---------------------------------------------");




//todo [4]
console.log(
    "%c [4] ",
    "color: yellow; background-color: #2274A5",
);
//? Використовуючи метод взаємодії з користувачем 
//? для отимання даних з полем введення, отримайте від користувача
//? за допомогою цього поля будь яке ЧИСЛОВЕ значення - <number>
//? та перевірте, чи воно більше за 10 та менше за 20.
//? Якщо так ✅, то виведіть повідомлення: "✅ Число <number> входить в діапазон від 10 до 20",
//? якщо ні ❌, то виведіть повідомлення: "❌ Число <number> НЕ входить в діапазон від 10 до 20".
//? ⚠️ Додатково треба зробити такі перевіркі отриманого значення:
//? - на значення null,
//? - на пустий рядок "",
//? - на рядок в якому є лише пробіл(и),
//? - на число
//? та вивести відповідне повідомлення з помилкою, 
//? якщо введені дані не пройшли перевірку.
//! Код виконаного завдання
// const field5 = prompt("Введіть  число")?.trim();
// if (field5 === undefined){
//     console.log("❌ Ви скасували введення.");
//      alert("❌ Ви скасували введення.");
// } else if (field5 === ""){
//          console.log("❌ Ви ввели порожній рядок або лише пробіли.");
//      alert("❌ Ви ввели порожній рядок або лише пробіли.")
// }else if (isNaN(field5)) {
//     console.log("❌ Потрібно вводити числа!");
//          alert("❌ Потрібно вводити числа!")
// } else{
//     let field5Number = Number(field5)

//       if (field5Number > 10 && field5Number < 20){
//         console.log(`✅ Число ${field5Number} входить в діапазон від 10 до 20`);
//     }else {
//         console.log(`❌ Число ${field5Number} НЕ входить в діапазон від 10 до 20`);
//     }
// }
console.log("---------------------------------------------");


//todo [5]
console.log(
    "%c [5] ",
    "color: yellow; background-color: #2274A5",
);
//? Використовуючи метод взаємодії з користувачем 
//? для отимання даних з полем введення, 
//? послідовно створити поля з веденням таких даних:
//?  - ім'я <name>,
//?  - електронна пошта <email>,
//?  - пароль <password>.
//? ⚠️ Введені дані повинні проходити перевірку на такі умови: 
//?  - ім'я <name> містить не менше 3 символів, 
//?  - електронна пошта <email> містить символ @ та крапку після неї, 
//?  - пароль <password> містить не менше 6 символів.
//? ❌ Якщо введені дані не пройшли ці перевірки 
//? треба вивести відповідні повідомлення з помилками(помилкою).
//? ⚠️ Додатково треба зробити такі перевіркі ВСІХ отриманих даних:
//? - на значення null,
//? - на пустий рядок "",
//? - на рядок в якому є лише пробіл(и),
//? - на число
//? ❌та вивести відповідне повідомлення з помилками(помилкою), 
//? якщо введені дані не пройшли ці перевірки.
//? ✅ Якщо введені дані пройшли ВСІ перевірки,
//? треба послідовно вивести в косоль значення цих даних.

//! Код виконаного завдання
let userName;
let email;
let password;
//! var1 
// email = prompt("Введіть  email")?.trim();
// if (email === undefined) {
//     console.log("❌ Ви скасували введення.");
//     alert("❌ Ви скасували введення.");
// } else if (email === "") {
//     console.log("❌ Ви ввели порожній рядок або лише пробіли.");
//     alert("❌ Ви ввели порожній рядок або лише пробіли.")
// } else if (!(email.includes("@") && email.includes(".") && email.length >= 5)) {
//     console.log("❌ email повинен мати символ '@',крапку та 5 символів.");
//     alert("❌ email повинен мати символ '@',крапку та 5 символів.");
// } else {
//     password = prompt("Введіть  пароль")?.trim();
//     if (password === undefined) {
//         console.log("❌ Ви скасували введення.");
//         alert("❌ Ви скасували введення.");
//     } else if (password === "") {
//         console.log("❌ Ви ввели порожній рядок або лише пробіли.");
//         alert("❌ Ви ввели порожній рядок або лише пробіли.")
//     } else if (password.length <= 6) {
//         console.log("❌ Пароль повинен містити не менше 6 символів.");
//         alert("❌ Пароль повинен містити не менше 6 символів.");
//     } else {
//         let userName = prompt("Введіть ім'я")?.trim();
//         if (userName === undefined) {
//             console.log("❌ Ви скасували введення.");
//             alert("❌ Ви скасували введення.");
//         } else if (userName === "") {
//             console.log("❌ Ви ввели порожній рядок або лише пробіли.");
//             alert("❌ Ви ввели порожній рядок або лише пробіли.");
//         } else if (userName.length <= 3) {
//             console.log("❌ Ім'я повинно містити не менше 3 символів.");
//             alert("❌ Ім'я повинно містити не менше 3 символів.");
//         } else {
//             console.log("Ім'я:", userName);
//             console.log("Email:", email);
//             console.log("Пароль:", password);
//         }
//     }
// }
//! var2 
while (true) {
    email = prompt("Введіть email")?.trim();
    if (email === undefined) {
        console.log("❌ Ви скасували введення.");
        alert("❌ Ви скасували введення.");
        continue;
    } else if (email === "") {
        console.log("❌ Ви ввели порожній рядок.");
        alert("❌ Ви ввели порожній рядок.");
        continue;
    } else if (!(email.includes("@") && email.includes(".") && email.length >= 5)) {
        console.log("❌ Email повинен містити символ '@', крапку та мінімум 5 символів.");
        alert("❌ Email повинен містити символ '@', крапку та мінімум 5 символів.");
        continue;
    }
    break;
}

while (true) {
    password = prompt("Введіть пароль")?.trim();
    if (password === undefined) {
        console.log("❌ Ви скасували введення.");
        alert("❌ Ви скасували введення.");
        continue;
    } else if (password === "") {
        console.log("❌ Ви ввели порожній рядок.");
        alert("❌ Ви ввели порожній рядок.");
        continue;
    } else if (password.length < 6) {
        console.log("❌ Пароль повинен містити не менше 6 символів.");
        alert("❌ Пароль повинен містити не менше 6 символів.");
        continue;
    }
    break;
}

while (true) {
    userName = prompt("Введіть ім'я")?.trim();
    if (userName === undefined) {
        console.log("❌ Ви скасували введення.");
        alert("❌ Ви скасували введення.");
        continue;
    } else if (userName === "") {
        console.log("❌ Ви ввели порожній рядок.");
        alert("❌ Ви ввели порожній рядок.");
        continue;
    } else if (userName.length < 3) {
        console.log("❌ Ім'я повинно містити не менше 3 символів.");
        alert("❌ Ім'я повинно містити не менше 3 символів.");
        continue;
    }
    break;
}

console.log("Ім'я:", userName);
console.log("Email:", email);
console.log("Пароль:", password);


console.log("---------------------------------------------");

