import"./modulepreload-polyfill-3cfb730f.js";//! Встановлення Node.js
console.warn(`Встановлення Node.js: 
 https://nodejs.org/en/download/`);//! Основні команди
console.warn("Основні команди:");console.log(`%c
    pwd — показує поточну дерикторію, де ви знаходитесь
    ls — показати які файли і папки
    clear — очистити термінал або ctrl+l
    ls -l — показати всі файли
    ls -la — показати разом з прихованими файлами
    cd — навгація по папкам
    cd D: — виходить на диск D
    touch — створює новий файл
    mv — переіменовує/переміщує файл або папку
    mkdir — створює нову папку
    rm — видаляє файл
    rmdir — видаляє папку
    `,"color: blue; font-size: 18px");console.log("--------------------------------------------------------------------------------------");//! Команди NPM
console.warn(`Документація NPM: 
 https://docs.npmjs.com/`);console.warn("Основні команди:");console.log(`%c
    npm init — ініціалізує npm в проєкті і створює файл package.json
    npm install — встановлює всі залежності, перелічені в package.json
    npm list --depth=0 — виведе в терміналі список локально встановлених пакетів з номерами їх версій, без залежностей
    npm install [package-name] — встановить пакет локально у папку node_modules
    npm uninstall [package-name] — видалить пакет, встановлений локально і оновить package.json
    npm start і npm test — запустить скрипт start або test, розташований в package.json
    npm run [custom-script] — запустить кастомний скрипт, розташований в package.json
    npm outdated — використовується для пошуку оновлень, виявить сумісні версії програмно і виведе список доступних оновлень
    npm update — оновить всі пакети до максимально дозволеної версії
    `,"color: blue; font-size: 18px");console.log("--------------------------------------------------------------------------------------------------------");//!+- Використання бібліотеки Lodash - var.1 (метод рахує суму двох чисел)
//! використання бібліотеки nanoid
