import"./modulepreload-polyfill-3cfb730f.js";//! Приклад-1: setTimeout()
console.warn("Приклад-1: setTimeout():");//! Приклад-2: setTimeout()
console.warn("Приклад-2: setTimeout():");//! ❌ Видалення таймера
//! Таймер: setInterval()
console.log(`%c
    const intervalId = setInterval(callback, delay, arg1, arg2, ...);
    `,"color: blue; font-size: 18px");console.log("----------------------------------------------------------------------------------------------------");//! Приклад-1: setInterval()
//! ✅ Старт таймера кнопкою
//! ✅❌ Видалення/зупинення таймера кнопкою
//! Приклад-1 таймера відкладеного старту з конспекту
console.warn("Приклад-1 таймера відкладеного старту з конспекту:");console.log(`%c
    let seconds = 10;
    let timerId = setTimeout(
        function() {
            console.log("Time's up!");
        },
        seconds * 1000
    );
    `,"color: blue; font-size: 18px");console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");console.log("----------------------------------------------------------------------------------------------------");//! КРОК-1.1.Створюємо простий таймер відкладеного старту
console.warn("КРОК-1.1.Створюємо простий таймер відкладеного старту:");console.log(`%c
    const timeBeforeStart = 3000; //! час до старту

    function timeСount() {
        console.log(
            "Спрацювала функція timeСount() через",
            timeBeforeStart/1000,
            "секунди"
        );
    };
    
    const timerId = setTimeout(timeСount, timeBeforeStart);
    `,"color: blue; font-size: 18px");console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");console.log("----------------------------------------------------------------------------------------------------");//! КРОК-1.2.Зробимо таймер прямого відліку
console.warn("КРОК-1.2.Зробимо таймер прямого відліку:");console.log(`%c
    let timerId;
    const timeBeforeStart = 1000; //! час між відліками
    const iterations = 10; //! кількість ітерацій

    for (let index = 1; index <= iterations; index++) {
    timerId = setTimeout(
        function timeСount() {
            console.log(
                index,
                "Спрацювала функція timeСount()"
            );
        }, index * timeBeforeStart);
    };
    `,"color: blue; font-size: 18px");console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");console.log("----------------------------------------------------------------------------------------------------");//! об'єкт - це "коробка" в якій зберігаються речі однієї категорії 
const e={bread1:"родиний",bread2:"батон",bread3:"хлібці смаженні"};console.log("breads:",e);console.log("breads.bread1:",e.bread1);console.log("breads.bread2:",e.bread2);delete e.bread2;console.log("breads:",e);e.bread4="сонячний";console.log("breads:",e);e.bread4="КиївХліб";console.log("breads:",e);const l={heroes:["Дарт Вейдер","Граф Дуку","Люк Скайвокер","Лея Органа","Обі-Ван Кенобі"],getHeroes(){console.log("✅ Цей метод буде повертати всіх героїв"),console.log("✅ heroes:",l.heroes)},addHeroes(o){console.log("Цей метод додає героя"),l.heroes.push(o),console.log("this:",this),this.heroes.push(o)}};l.getHeroes();l.addHeroes("Падме Амідала");l.getHeroes();console.log("----------------------------------------------------------------------------------------------------");//! КРОК-1.3.Зробимо таймер зворотного відліку
//! КРОК-1.4.Додамо умову зупинення таймеру
//! КРОК-1.5.Додамо кнопки керування стартом та зупиненням таймеру
//! ✅ Старт таймера кнопкою
//! КРОК-2.1.Створюємо простий таймер(секундомір) та зупинимо його через 5 інтервалів(1 інтервал = 1 секунді)
//! КРОК-2.2.Додамо лічильник часу та умову зупинення таймеру
//! КРОК-2.3.Додамо інтерфейс керування таймером: 
//!  - введення інтервалу до зупинення таймеру (у секундах),
//!  - кнопки старту та зупинення таймеру.
const r=1e3;//! час між відліками
let n=null;//! для видалення ідентифікатора кнопкою
const s=document.getElementById("info-input"),c=document.getElementById("stop-counter"),a=document.getElementById("start-set-interval");//! кнопка <Start setInterval>
const i=document.getElementById("stop-set-interval");//! кнопка <Stop setInterval>
//! Звук
const d=document.getElementById("alert"),u=document.getElementById("beep"),g=document.getElementById("stop"),m=document.getElementById("final");function p(){let o=0;//! початковий стан лічильник часу для ПРЯМОГО відліку
let t=parseInt(c.value);if(!t||t<1||t>20){s.style.color="red",s.textContent="Введіть число від 1 до 20!",console.error("Введіть число від 1 до 20!"),d.play();//! Звук
return}console.log("Кількість ітерацій до зупинення (stopCounter):",t);//!
n=setInterval(()=>{o++;//! для ПРЯМОГО відліку
console.log(`⏱️ ${o} - відлік часу в секундах, id: ${n}`),u.play();//! Звук
//! Умова зупинення таймеру:
if(o>=t){//! для ПРЯМОГО відліку
clearInterval(n),console.error(`🚫⏱️ Інтервал з ідентифікатором ${n} зупинено на ${t}-ій ітерації!`),setTimeout(()=>g.play(),300);//! Звук
}},r)}//! Старт таймера кнопкою <Start setInterval>
a.addEventListener("click",p);//! Видалення/зупинення таймера кнопкою <Stop setInterval>
i.addEventListener("click",()=>{clearInterval(n),console.warn(`⚠️⏱️Інтервал з ідентифікатором ${n} зупинено повністю!`),setTimeout(()=>m.play(),300);//! Звук
});console.log("----------------------------------------------------------------------------------------------------");
