import"./modulepreload-polyfill-3cfb730f.js";//! Предикатні функції
console.warn("Що таке Предикатна функція. Приклад:");const d=function(o){return o<=1};console.log("isInfant(1):",d(1));//! true
console.log("isInfant(3):",d(3));//! false
console.log("--------------------------------------------");//! Приклад-алгоритм приготування кави за допомогою функції "Приготування кави"
console.warn('Приклад функції "Приготування кави":');let l,i;//! 1 - функція "Приготування меленої кави"
function W(){return l="30 грам",console.log("1️⃣ Мелена кава є?",!!l),console.log(l),l}//! 2 - функція "Приготування окропу (гарячої води)".
function h(){return console.log("2️⃣ Окріп (гаряча вода) є?",!!i),i}//! 3 - функція "Приготування кави"
function A(){if(!W())return"Потрібна мелена кава!";if(!h())return"Потрібна гаряча вода!"}console.log(A());console.log("--------------------------------------------");//! Виклик функції або передача посилання на функцію
const w=function(o){return`Ласкаво просимо ${o}.`},B=4;console.warn("Виклик функції:");console.log(w("Манго"));//! 'Ласкаво просимо Манго'.
console.warn("Передача посилання на функцію:");console.log(w);//! ƒ greet1() { return `Ласкаво просимо ${name}.`; }
console.log(B);//! 4 
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . .");//! Колбек-функції
console.warn("Колбек-функції:");function G(o){console.log(`Global -> Ласкаво просимо ${o}.`)}function b(o){console.log(`Global -> Wellcome ${o}.`)}function m(o,n){console.log(`Реєструємо гостя ${o}.`),n(o)}m("Манго",G);//! 'Реєструємо гостя Манго.'  'Ласкаво просимо Манго.'
m("Манго",b);console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . .");const k="mipk",E="mipkol";function p(o){console.log(`а-це функція колбек ${o} `)}function H(o){console.log(`c-це функція колбек ${o} `)}function u(o,n){n(o)}u(k,p);u(E,H);u(k,function(n){console.log(`d-це функція колбек ${n} `)});//! Стрілкові(cтрілочні) функції
console.warn("Стрілкові(cтрілочні) функції:");function I(o,n,e){return o+n+e}console.log("classicAdd(1, 2, 3);",I(1,2,3));//! 6
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");const M=(o,n,e)=>o+n+e;console.log("arrowAdd(10, 20, 30);",M(10,20,30));//! 60
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");const U=o=>o+5;console.log("add(10);",U(10));//! 15
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");const j=()=>"Привіт!";console.log("greet();",j());//! 15
console.log("-------------------------------------------------------");//! Явне та неявне повернення
//! Явне повернення
console.warn("Явне повернення:");const $=(o,n,e)=>o+n+e;console.log("arrowAdd2(100, 200, 300);",$(100,200,300));//! 600
console.log("-------------------------------------------------------");//! Неявне повернення
console.warn("Неявне повернення:");console.log("arrowAdd2(1000, 2000, 3000);",$(1e3,2e3,3e3));//! 6000
console.log("-------------------------------------------------------");//! Псевдомасив arguments
console.warn("Псевдомасив arguments:");const q=(...o)=>{console.log("args:",o)};q(1,2,3);//! args: [1, 2, 3]
console.log("-------------------------------------------------------");//! в стрількових функціях так не працює (Array.from)
//! Стрілкові функції як колбеки
console.warn("Приклад-1: Анонімні стрілкові функції як колбеки:");const C=[5,10,15,20,25];C.forEach(function(o,n){console.log(`Індекс: ${n}, значення: ${o}`)});console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . .");C.forEach((o,n)=>{console.log(`Індекс: ${n}, значення: ${o}`)});console.log("-------------------------------------------------------");console.warn("Приклад-2: Стрілкові функції як колбеки:");const v=[5,10,15,20,25],x=(o,n)=>{console.log(`Індекс ${n}, значення ${o}`)};v.forEach(x);console.log("-------------------------------------------------------");//! Приклад-алгоритм "Приготування кави" за допомогою Колбек-функцій 
console.warn('Приклад функції "Приготування кави" за допомогою Колбек-функцій:');let c,r,g;//! 1 - функція "Приготування меленої кави"
function y(){return c="30 грам",console.log("1️⃣ Мелена кава є?",!!c),c}//! 2 - функція "Приготування окропу (гарячої води)".
function z(){return r="250 мілілітрів",console.log("2️⃣ Окріп (гаряча вода) є?",!!r),r}//! 3 - функція "Приготування кави"
function D(o,n){return o()?n()?(g=c+r,g="✅ Кава готова!",g):"Потрібна гаряча вода!":"Потрібна мелена кава!"}console.log(D(y,z));console.log("--------------------------------------------");//! Приклад-алгоритм "Приготування кави" за допомогою стрілкових-Колбек-функцій 
console.warn('Приклад функції "Приготування кави" за допомогою Колбек-функцій:');let s,t,f;//! 1 - функція "Приготування меленої кави"
const F=()=>(s="30 грам",console.log("1️⃣ Мелена кава є?",!!s),s);//! 2 - функція "Приготування окропу (гарячої води)".
const J=()=>(t="250 мілілітрів",console.log("2️⃣ Окріп (гаряча вода) є?",!!t),t);//! 3 - функція "Приготування кави"
const K=(o,n)=>o()?n()?(f=s+t,f="✅ Кава готова!",f):"Потрібна гаряча вода!":"Потрібна мелена кава!";console.log(K(F,J));console.log("--------------------------------------------");//! Приклад-алгоритм "Приготування кави" за допомогою стрілкових-Колбек-функцій 
console.warn('Приклад функції "Приготування кави" за допомогою Колбек-функцій:');let L,O,a;//! 1 - стрілкова функція з неявним поверненням  "Приготування меленої кави"
//! 2 - стрілкова функція з неявним поверненням "Приготування окропу (гарячої води)".
//! 3 - функція "Приготування кави"
const P=(o,n)=>o()?n()?(a=L+O,a="✅ Кава готова!",a):"Потрібна гаряча вода!":"Потрібна мелена кава!";//!анонімна стрілкова  функція з неявним поверненням
console.log(P(()=>"30 грам",()=>"250 мілілітрів"));console.log("--------------------------------------------");
