//! Асинхронні функції
//? ✳️ Робота з бекендом може бути заплутаною 
//? - після однієї асинхронної операції необхідно 
//? зробити ще один запит на сервер на підставі 
//? отриманих даних, і так кілька разів. 
//? Наприклад, на сторінці профілю користувач 
//? хоче подивитися список друзів. 
//? Перше, що необхідно зробити 
//? - підтвердити його права доступу до цієї сторінки на бекенді. 
//? Для цього потрібно зробити запит до my-api.com/me. 
//? Якщо бекенд дозволить доступ, у відповіді 
//? ми отримаємо унікальний токен доступу до захищених ресурсів.
console.warn("КРОК-1.Підтвердження прав доступу до сторінки:");
console.log(
    `%c
    const fetchFriends = () => {
        return fetch("my-api.com/me").then(token => {
            console.log(token);
        });
    };
    `,
    'color: blue; font-size: 18px',
);

console.warn("КРОК-2.Запит профілю користувача:");
//? ✳️ Потім необхідно зробити запит профілю користувача
//? з my-api.com/profile, але профіль - неповний,
//? він містить тільки критично важливу інформацію:
//? ідентифікатор користувача без списку друзів.
let token = "${token}"; //! для вірного відображення в console.log()
console.log(
    `%c
    const fetchFriends = () => {
        return fetch("my-api.com/me")
            .then(token => {
                return fetch('my-api.com/profile?token=${token}');
        })
        .then(user => {
            console.log(user.id);
        });
    };
    `,
    'color: blue; font-size: 18px',
);

console.warn("КРОК-3.Запит списку друзів:");
//? ✳️ І тільки після цього можна зробити запит
//? списку друзів з my-api.com/users/:userId/friends.
let user = { id: "${user.id}" }; //! для вірного відображення в console.log()
console.log(
    `%c
    const fetchFriends = () => {
        return fetch("my-api.com/me")
            .then(token => {
                return fetch('my-api.com/profile?token=${token}');
        })
        .then(user => {
            return fetch('my-api.com/users/${user.id}/friends');
        });
    };

    fetchFriends()
        .then(friends => console.log(friends))
        .catch(error => console.error(error));
    `,
    'color: blue; font-size: 18px',
);


//? ✳️ В результаті отримуємо, не найзручніший
//? для читання код, хоча операції - порівняно прості.
//? Оскільки ми передаємо функції-обробники методу then(),
//? утворюються ялинкоподібні вкладеності.





console.warn("КРОК-4.Код з асинхронними функціями:");
//? ✴️ Асинхронні функції допомагають 
//? позбавиться колбеків і вкладених конструкцій. 
//? Водночас, вони відмінно працюють разом із 
//? методами then() і catch(), 
//? тому що гарантовано повертають проміс.
console.log(
    `%c
    const fetchFriends = async () => {
        const token = await fetch("my-api.com/me");
        const user = await fetch('my-api.com/profile?token=${token}');
        const friends = await fetch('my-api.com/users/${ user.id }/friends');
        return friends;
    };

    fetchFriends()
        .then(friends => console.log(friends))
        .catch(error => console.error(error));
        `,
        'color: darkgreen; font-size: 18px',
);

console.log("-------------------------------------------------------------------------------------------------------------------");


//! Синтаксис async/await
console.warn("Синтаксис async/await:");
//? ✴️ Асинхронні функції (async/await)
//? - зручний спосіб написання асинхронного коду,
//? який зовні стає схожим на синхронний.
//? В основі синтаксису async/await лежать проміси,
//? тому він не блокує основний потік виконання програми.
//? ✴️ Для оголошення асинхронної стрілочної функції,
//? перед списком параметрів додаємо ключове слово async.
//? Всередині неї можна використовувати оператор await
//? і праворуч від нього поставити щось, що поверне проміс.
//? Метод response.json() також повертає проміс, тому ставимо await.
console.log(
  `%c
    const fetchUsers = async () => {
      const response = await fetch("https://jsonplaceholder.typicode.com/users");
      const users = await response.json();
      return users;
    };

    fetchUsers().then(users => console.log(users));
    `,
  'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------------------------------------------");




//! Використання синтаксису async/await
console.warn("Використання синтаксису async/await:");
//? ✴️ Коли інтерпретатор зустрічає await,
//? він призупиняє виконання цієї функції (не тільки скрипта)
//? і чекає, доки не виконається проміс праворуч від await.
//? Щойно проміс виконався - виконання функції відновлюється
//? і на рядку нижче нам доступний результат асинхронної операції.
//?     📌 Використання синтаксису async/await:
//? 🔸 Оператор await можна використовувати тільки у тілі асинхронної (async) функції.
//? 🔸 Оператор await призупиняє функцію, доки проміс не виконається (fulfilled або rejected).
//? 🔸 Якщо проміс виконався успішно (fulfilled), оператор await поверне його значення.
//? 🔸 Якщо проміс був відхилений з помилкою (rejected), оператор await викине помилку.
//? 🔸 Асинхронна функція завжди повертає проміс, тому будь-яке значення, що повертається, буде його значенням.
//? 🔸 Якщо не вказати значення, що повертається, повернеться проміс зі значенням undefined.
console.log(
  `%c
    🔸 Оператор await можна використовувати тільки у тілі асинхронної (async) функції.
    🔸 Оператор await призупиняє функцію, доки проміс не виконається (fulfilled або rejected).
    🔸 Якщо проміс виконався успішно (fulfilled), оператор await поверне його значення.
    🔸 Якщо проміс був відхилений з помилкою (rejected), оператор await викине помилку.
    🔸 Асинхронна функція завжди повертає проміс, тому будь-яке значення, що повертається, буде його значенням.
    🔸 Якщо не вказати значення, що повертається, повернеться проміс зі значенням undefined.
    `,
  'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------------------------------------------");
test();
function test (){
  console.log("HELLO!!!")
}
// test();
// test2()
const test2 = function (){
  console.log("Hello2!!!");
}

test2()

const test3 = a => {
    return a;
};
// test3("HELLO3!!!")
  console.log("test3:",test3("HELLO3!!!"))


  const test4 = a => a + "!!!";

  console.log("test4:",test4("HELLO4"))

  //! Приклади використання синтаксису async/await
console.warn("Приклади використання синтаксису async/await:");
//? ✳️ Будь-яка функція може бути асинхронною, 
//? чи то метод об'єкта, класу, колбек, оголошення 
//? або інлайн функція. 
//? Всі вони зможуть використовувати оператор await 
//? і обов'язково повернуть проміс, 
//? тому що будуть асинхронними функціями.
console.log(
  `%c
    //! Function declaration
    async function foo() {
      // ...
    }


    //! Functional expression
    const foo = async function () {
      // ...
    };


    //! Arrow function
    const foo = async () => {
      // ...
    };


    //! Object method
    const user = {
      async foo() {
        // ...
      },
    };


    //! Class method
    class User {
      async foo() {
        // ...
      }
    }
    `,
  'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------------------------------------------");
