console.log ("practice 29");
//! Дата і час
//? ✴️ Клас Date безпосередньо абстрагує більшу частину роботи з датами.
//? Це дозволяє нам відображати моменти у часі як об'єкти
//? і маніпулювати ними заздалегідь визначеними методами.
//? Використовуючи можливості класу Date, можна створювати годинник,
//? лічильники, календарі та інші інтерактивні елементи інтефрейсу.


//! Клас new Date() (поточна дата)
console.warn("Клас new Date() (поточна дата):");
//? ✴️ Екземпляр класа Date - це об'єкт, що відображає певний момент часу.
//? Створення дати без аргументів повертає об'єкт, що зберігає дату і час
//? на момент його ініціалізації, тобто поточні.
//? У рядковому перетворенні об'єкт повертає результат виклику
//? методу toString(), тому у другому лозі ми отримаємо рядок, а не об'єкт.
console.log(
    `%c
    const date = new Date(); //! поточна дата
    `,
    'color: blue; font-size: 18px',
);
const date = new Date(); //! поточна дата

console.log("date:", date); //! "Thu Jul 24 2025 19:36:39 GMT+0300 (Восточная Европа, летнее время)"
console.log("typeof date:", typeof date); //! object
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("date.toString():", date.toString()); //! "Thu Jul 24 2025 19:36:39 GMT+0300 (Восточная Европа, летнее время)"
console.log("typeof date.toString():", typeof date.toString()); //! string
console.log("------------------------------------------------------------------------------------");

//! Клас new Date(string)
console.warn("Клас new Date(string):");
//? ✳️ Оскільки вище не були передані аргументи,
//? була створена поточна дата і час.
//? Однак, можна додатково передати рядок або число в Date,
//? і результатом буде об'єкт, що описує зазначену дату і час.

//? ✴️ Створюючи екземпляр класу Date, можна встановити дату рядком.
//? Рядок може описувати тільки дату або дату і час.
const teamMeetingDate = new Date("March 16, 2030");
console.log('teamMeetingDate = new Date("March 16, 2030"):\n',  teamMeetingDate);  //! "Mon Mar 16 2030 00:00:00 GMT+0200 (Eastern European Standard Time)"

const preciseTeamMeetingDate = new Date("March 16, 2030 14:25:00");
console.log('preciseTeamMeetingDate = new Date("March 16, 2030 14:25:00"):\n', preciseTeamMeetingDate);  //! "Mon Mar 16 2030 14:25:00 GMT+0200 (Eastern European Standard Time)"
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

//? ✳️ Встановлення часу у вигляді рядків
//? внутрішньо викликає метод Date.parse(),
//? який перетворює рядок у число - кількість мілісекунд.
//? Саме тому формат переданого рядка - дуже гнучкий.
//? Наприклад, можна не вказувати нуль для днів і місяця.
//? Розглянемо кілька прикладів, які матимуть майже однаковий результат:
console.log(
    `%c
    Маємо майже однаковий результат:
    
    new Date("2030");
    new Date("2030-03");
    new Date("2030-03-16");
    new Date("03/16/2030");
    new Date("2030/03/16");
    new Date("2030/3/16");
    new Date("March 16, 2030");
    new Date("16 March 2030");
    new Date("March 16, 2030 14:25:00");
    new Date("2030-03-16 14:25:00");
    new Date("2030-03-16T14:25:00");

    new Date("Sat Mar 16 2030 19:25:00 GMT+0200");
    `,
    'color: blue; font-size: 18px',
);
const futureDate0 = new Date("2030");
const futureDate1 = new Date("2030-03");
const futureDate2 = new Date("2030-03-16");
const futureDate3 = new Date("03/16/2030");
const futureDate4 = new Date("2030/03/16");
const futureDate5 = new Date("2030/3/16");
const futureDate6 = new Date("March 16, 2030");
const futureDate7 = new Date("16 March 2030");
const futureDate8 = new Date("March 16, 2030 14:25:00");
const futureDate9 = new Date("2030-03-16 14:25:00");
const futureDate10 = new Date("2030-03-16T14:25:00");

const futureDate11 = new Date("Sat Mar 16 2030 14:25:00 GMT+0200");

console.log(
    "\n", futureDate0,
    "\n", futureDate1,
    "\n", futureDate2, 
    "\n", futureDate3, 
    "\n", futureDate4, 
    "\n", futureDate5, 
    "\n", futureDate6, 
    "\n", futureDate7, 
    "\n", futureDate8, 
    "\n", futureDate9, 
    "\n", futureDate10,
    "\n",
    "\n", futureDate11
);
console.log("------------------------------------------------------------------------------------");
//! Метод - Date.parse(string)
console.warn("Метод - Date.parse(string):");
//? ✴️ Метод Date.parse(str) може читати дату з рядка
//? та перетворює рядок у число - кількість мілісекунд.
//? ✴️ Виклик Date.parse(str) аналізує рядок у заданому форматі 
//? та повертає timestamp (кількість мілісекунд з 1 січня 1970 UTC+0). 
//? Якщо формат недійсний, повертає NaN.
console.log(
    `%c
    Date.parse("2030-03-16T14:25:00.000+02:00");
    `,
    'color: blue; font-size: 18px',
);
const timestampDateParse = Date.parse("2030-03-16T14:25:00.000+02:00");
console.log('timestampDateParse = Date.parse("2030-03-16T14:25:00.000+02:00"):', timestampDateParse);  //! 1899894300000 (timestamp)
console.log("typeof timestampDateParse:", typeof timestampDateParse); //! number

//! ✳️ Формат недійсний, повертає NaN:
const timestampDateParseError = Date.parse("2030-03-16T14:25:00.000Z");
console.log('timestampDateParseError = Date.parse("2030-03-16T14:25:00.000+Z"):', timestampDateParseError);  //! NaN

//? ✳️ Формат рядка повинен бути:
//? YYYY - MM - DDTHH: mm: ss.sssZ,
//? 📌 де:
//? 🔸 YYYY-MM-DD — це дата: рік-місяць-день.
//? 🔸 Символ "T" використовується як роздільник.
//? 🔸 HH:mm:ss.sss — це час: години, хвилини, секунди і мілісекунди.
//? 🔸 'Z' - необов’язкова частина яка позначає часовий пояс у форматі +-hh:mm.
//?    Одинична буква Z буде означати UTC+0.

//? ✳️ Коротші варіанти також можливі, як YYYY-MM-DD або YYYY-MM або навіть YYYY.

console.log(
    `%c
            Формат рядка:

        YYYY - MM - DDTHH: mm: ss.sssZ
    
    🔸 YYYY-MM-DD — це дата: рік-місяць-день.
    🔸 Символ "T" використовується як роздільник.
    🔸 HH:mm:ss.sss — це час:
       години, хвилини, секунди і мілісекунди.
    🔸 'Z' - необов’язкова частина яка позначає
       часовий пояс у форматі +-hh:mm.
       Одинична буква Z буде означати UTC+0.
    `,
    'color: blue; font-size: 18px',
);
console.log("------------------------------------------------------------------------------------");
//! Створення дати. 7 аргументів.
console.warn("Створення дати. 7 аргументів.:");
//? ✴️ Інший спосіб створення нових об'єктів Date — це передати 7 чисел.
//? Ці числа описують рік, місяць, день, годину, хвилину, секунду і мілісекунду.
//? ✴️ Останні 4 аргументу необов'язкові.
console.log(
    `%c
    ❗️❗️❗️ Індекси місяців починаються з 0 ❗️❗️❗️

    const fullDate = new Date(
        year,
        month,
        date,
        hours,
        minutes,
        seconds,
        ms
    )
    `,
    'color: blue; font-size: 18px',
);
const fullDate = new Date(2030, 2, 16, 14, 25, 0, 0); //! індекси місяців починаються з 0, тому 5-й місяць це липень.
console.log('fullDate = new Date(2030, 2, 16, 14, 25, 0, 0):\n', fullDate);  //! "Sat Mar 16 2030 14:25:00 GMT+0200 (Восточная Европа, стандартное время)"
console.log("-------------------------------------------------------------------------");
//! new Date(number)
console.warn("new Date(numder):");
//? ✳️ В області інформатики існує концепція епохи Unix.
//? Цей момент часу встановлений на
//? північ 1 січня 1970 року в часовому поясі UTC.
//? ✴️ Внутрішньо дати відображені в мілісекундах, 
//? що минули після опівночі 1 січня 1970 року у часовому поясі UTC. 
//? Для комп'ютера - це дата початку відліку часу - Unix час. 
//? Тому під час ініціалізації дати одним числом, 
//? воно являє собою кількість мілісекунд, що вже минула.
console.log(
    `%c
    - Дата початку відліку часу - 1 січня 1970 року,
    - Unix час,
    - timestamp.

    const startDate0 = new Date(0); 
    `,
    'color: blue; font-size: 18px',
);
//? ✳️ В клас Date можна додатково передати число,
//? і результатом буде об'єкт, що описує зазначену дату і час.
const startDate0 = new Date(0); //! дата початку відліку часу - 1 січня 1970 року - Unix час - timestamp
console.log("startDate0 = new Date(0):", startDate0); //! Thu Jan 01 1970 03:00:00 GMT+0300 (Восточная Европа, стандартное время)
const startDate1000 = new Date(1000); 

//! Повертає числове значення цієї дати (timestamp) - кількість мілісекунд, що минула з півночі 1 січня 1970 року.
console.log("startDate1000 = new Date(1000):", startDate1000); //! Thu Jan 01 1970 03:00:01 GMT+0300 (Восточная Европа, стандартное время)

console.log("new Date(1899894300000):", new Date(1899894300000)); //! Sat Mar 16 2030 19:25:00 GMT+0200 (Восточная Европа, стандартное время)

console.log("new Date(1753541240287):", new Date(1753541240287)); //! Sat Jul 26 2025 17:47:20 GMT+0300 (Восточная Европа, летнее время)
console.log("--------------------------------------------------------------------------------------------------------");
//! Date.now()
console.warn("Date.now():");
//? ✴️ Щоб побачити число мілісекунд від цієї дати до
//? поточного моменту, використовується статичний метод Date.now().

//? ✳️ Зручність цього формату полягає в тому, 
//? що можна представляти точні моменти часу 
//? у вигляді одного числа і не турбуватися 
//? про дати, рядки і часові пояси, 
//? оскільки можна отримати всю необхідну інформацію коли необхідно.
console.log(
    `%c
    const date = Date.now();
    `,
    'color: blue; font-size: 18px',
);
const dateNow = Date.now();
console.log("date = Date.now():", dateNow); //! 1753541240287
console.log("typeof date:", typeof dateNow); //! number
console.log("--------------------------------------------------------------------------------------------------------");
const data2 = new Date(dateNow);
console.log("data2:",data2);
//! Методи new Date()
//? ✴️ Екземпляр класу Date має безліч методів
//? для читання і запису значень дати і часу.
//? Методи повертають або присвоюють рік, місяць,
//? день місяця або тижня, годину, хвилину, секунду
//? і мілісекунду для кожного екземпляра.
//? Ці дані можуть бути у вигляді рядка
//? з урахуванням місцевого календаря або мови.


//! Геттери
console.warn("Геттери:");
//? ✴️ Геттери використовуються для читання усієї дати 
//? або окремої складової. Значення, що повертається, 
//? залежить від поточного часового поясу, 
//? встановленого на вашому комп'ютері.
console.log(
    `%c
    const date = new Date();
    ----------------------------------------------------------------------------
    date.getDate() - повертає день місяця від 1 до 31

    date.getDay() -  повертає день тижня від 0 до 6

    date.getMonth() - повертає місяць від 0 до 11

    date.getFullYear() - повертає рік з 4 цифр

    date.getHours() - повертає години

    date.getMinutes() - повертає хвилини

    date.getSeconds() - повертає секунди

    date.getMilliseconds() - повертає мілісекунди

    date.getTime() - повертає кількість мілісекунд минулих зі старту епохи Unix
    ----------------------------------------------------------------------------
    `,
    'color: blue; font-size: 18px',
);
const date3 = new Date();
// const date = new Date("Sun Jul 27 2025 16:39:21.358 GMT+0300");
console.log("date3: ", date3); //! Sun Jul 27 2025 16:39:21 GMT+0300 (Восточная Европа, летнее время)
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

//? Повертає день місяця від 1 до 31:
console.log("date3.getDate(): ", date3.getDate()); //! 27

//? Повертає день тижня від 0 до 6:
console.log("date3.getDay(): ", date3.getDay()); //! 0

//? Повертає місяць від 0 до 11:
console.log("date3.getMonth(): ", date3.getMonth()); //! 6

//? Повертає рік з 4 цифр:
console.log("date3.getFullYear(): ", date3.getFullYear()); //! 2025

//? Повертає години:
console.log("date3.getHours(): ", date3.getHours()); //! 16

//? Повертає хвилини:
console.log("date3.getMinutes(): ", date3.getMinutes()); //! 39

//? Повертає секунди:
console.log("date3.getSeconds(): ", date3.getSeconds()); //! 21

//? Повертає мілісекунди:
console.log("date3.getMilliseconds(): ", date3.getMilliseconds()); //! 358

//? Повертає кількість мілісекунд минулих зі старту епохи Unix:
console.log("getTime():", date3.getTime());
console.log("------------------------------------------------------------------------------------------------------------------------");
    const timestampDateParse1 = Date.parse(date3);
console.log("timestampDateParse1:",timestampDateParse1);
console.log("date = Date.now():", dateNow); 


//! Приклад форматування поточної дати
console.warn("Приклад форматування поточної дати:");
const currentDate = new Date();

//? Час в мс з початку епохи Unix: ....  значення будуть змінюватися
console.log(`Час в мс з початку епохи Unix: ${currentDate.getTime()}`);

let result = ' Дата: ';

result += currentDate.getDate() + '/'; //! день
result += (currentDate.getMonth() + 1) + '/'; //! місяць
result += currentDate.getFullYear() + ','; //! рік

result += '\n День тижня: ' + convertDayOfWeek(currentDate.getDay()) + ','; //! день тижня

result += '\n Час: ' + currentDate.getHours() + ':'; //! години
result += currentDate.getMinutes() + ':'; //! хвилини
result += currentDate.getSeconds() + ':'; //! секунди
result += currentDate.getMilliseconds() + ''; //! мілісекунди

//? Рядок повинен показати поточу дату та час:
console.log(result); //! ...  значення будуть змінюватися
//! Дата: 27/7/2025,
//! День тижня: неділя,
//! Час: 17:3:41:541

//? Функция конвертує день тижня у звичний нам рядковий формат:
// todo: var.1
// function convertDayOfWeek(dayOfWeek) {
//     console.error("currentDate.getDay():", dayOfWeek); //!
//     let dayOfWeekString = "";

//     switch (dayOfWeek) {
//         case 0:
//             dayOfWeekString = "неділя";
//             break;
//         case 1:
//             dayOfWeekString = "понеділок";
//             break;
//         case 2:
//             dayOfWeekString = "вівторок";
//             break;
//         case 3:
//             dayOfWeekString = "середа";
//             break;
//         case 4:
//             dayOfWeekString = "четвер";
//             break;
//         case 5:
//             dayOfWeekString = "п'ятниця";
//             break;
//         case 6:
//             dayOfWeekString = "субота";
//             break;
//         default:
//             console.warn("ERROR"); //! інструкції default блока;
//     };
//     // console.log("День тижня:", dayOfWeekString); //!
//     return dayOfWeekString;
// };

// todo: var.2 (приклад Валерія Шмідта)
function convertDayOfWeek(dayOfWeek) {
    const week = [
        'Неділя',
        'Понеділок',
        'Вівторок',
        'Середа',
        'Четверг',
        "П'ятниця",
        'Субота'
    ];
    return week[dayOfWeek];
};
// convertDayOfWeek(currentDate.getDay());
console.log("------------------------------------------------------------------------------------------------------------------------");


//! Геттери у форматі UTC
console.warn("Геттери у форматі UTC:");
//? ✴️ Існують еквівалентні версії цих методів,
//? які повертають значення у форматі UTC (Coordinated Universal Time),
//? а не адаптовані до поточного часового поясу користувача.
console.log(
    `%c
    const date = new Date();
    ----------------------------------------------------------------------------
    date.getUTCDate() - повертає день місяця від 1 до 31

    date.getUTCDay() -  повертає день тижня від 0 до 6

    date.getUTCMonth() - повертає місяць від 0 до 11

    date.getUTCFullYear() - повертає рік з 4 цифр

    date.getUTCHours() - повертає години

    date.getUTCMinutes() - повертає хвилини

    date.getUTCSeconds() - повертає секунди

    date.getUTCMilliseconds() - повертає мілісекунди
    ----------------------------------------------------------------------------
    `,
    'color: darkgreen; font-size: 18px',
); console.log("------------------------------------------------------------------------------------------------------------------------");
//! Методи new Date(): Сеттери
//? ✴️ Все, що можна прочитати - можна записати,
//? методи для запису називаються також геттери,
//? але починаються з префіксу set.
//? Також для всіх методів існують їх UTC еквіваленти.
console.log(
    `%c
    const date = new Date();
    -------------------------------------------------------------------------------
    date.setDate() - встановлює день місяця від 1 до 31

    date.setDay() -  встановлює день тижня від 0 до 6

    date.setMonth() - встановлює місяць від 0 до 11

    date.setFullYear() - встановлює рік з 4 цифр

    date.setHours() - встановлює години

    date.setMinutes() - встановлює хвилини

    date.setSeconds() - встановлює секунди

    date.setMilliseconds() - встановлює мілісекунди

    date.setTime() - встановлює кількість мілісекунд минулих зі старту епохи Unix
    -------------------------------------------------------------------------------
    `,
    'color: blue; font-size: 18px',
);
const date4 = new Date("March 16, 2030 14:25:00");
console.log("date4: ", date4); //! Sat Mar 16 2030 14:25:00 GMT+0200 (Восточная Европа, стандартное время)
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . .");

console.log("date4.setMinutes(50):", date4.setMinutes(50)); //! 1899895800000
console.log("date4-->setMinutes(50): ", date4); //! Sat Mar 16 2030 14:50:00 GMT+0200 (Восточная Европа, стандартное время)
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . .");

console.log("date4.setFullYear(2040, 4, 8):", date4.setFullYear(2040, 4, 8)); //! 2220090600000
console.log("date4-->setFullYear(2040, 4, 8): ", date4); //! Tue May 08 2040 14:50:00 GMT+0300 (Восточная Европа, летнее время)
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . .");


console.log("date4.setTime():", date4.setTime(3330090600000)); //! 3330090600000
console.log("date4-->date.setTime(3330090600000): ", date4); //! Thu Jul 11 2075 20:10:00 GMT+0300 (Восточная Европа, летнее время)
console.log("----------------------------------------------------------------------------------------------------------------------------");
const newNowDay1= new Date();
 console.log("newNowDay1:",newNowDay1);
const newNowDay2= new Date();
  console.log("newNowDay2:",newNowDay2);
console.log("newNowDay1.getTime():",newNowDay1.getTime());
console.log("newNowDay2.getTime():",newNowDay2.getTime());
//! створення дати тайм-штамп
const newNowDayUnix = Date.now();
console.log("newNowDayUnix:",newNowDayUnix);


//! Форматування дати
//? ✴️ Об'єкт дати може бути представлений
//? у різних рядкових і числових форматах.
//? Для цього існує цілий набір методів.

//?   📌 Наприклад:
//? 🔸 toString(),
//? 🔸 toDateString(),
//? 🔸 toTimeString()
//?  - повертають стандартне рядкове відображення,
//? що не задане жорстко у стандарті,
//? а залежить від браузера.
//? Єдина вимога до нього - читабельність для людини.

//? ✳️ Метод toString() повертає дату повністю,
//? а toDateString() і toTimeString() - тільки дату і час відповідно.

// const date6 = new Date("March 16, 2030 14:25:00");
const date6 = new Date();
console.log("date6: ", date6); //! Sat Mar 16 2030 14:25:00 GMT+0200 (Восточная Европа, стандартное время)

console.log("date6.toString():", date6.toString()); //! "Sat Mar 16 2030 14:25:00 GMT+0200 (Восточная Европа, стандартное время)"

console.log("date6.toTimeString():", date6.toTimeString()); //! "14:25:00 GMT+0200 (Восточная Европа, стандартное время)"

console.log("date6.toLocaleTimeString():", date6.toLocaleTimeString()); //! "14:25:00"

console.log("date6.toUTCString():", date6.toUTCString()); //! "Sat, 16 Mar 2030 12:25:00 GMT"

console.log("date6.todateString():", date6.toDateString()); //! "Sat Mar 16 2030"

console.log("date6.toISOString():", date6.toISOString()); //! "2030-03-16T12:25:00.000Z"

console.log("date6.toLocaleString():", date6.toLocaleString()); //! "16.03.2030, 14:25:00"

console.log("date6.getTime():", date6.getTime()); //! 1899894300000
console.log("-------------------------------------------------------------------------------------------");




//! Новий стандарт форматування дати
console.warn("Новий стандарт форматування дати:");
//? ✴️ У всіх браузерах, крім IE10-, підтримується новий стандарт,
//? який додає спеціальні методи для форматування дат.

//? ✴️ Це робиться викликом date.toLocaleString (locale, opts),
//? в якому можна задати багато налаштувань.
//? Він дозволяє вказати, які параметри дати потрібно вивести,
//? і ряд налаштувань виведення, після чого інтерпретатор сам сформує рядок.

// const newStandardDateFormatting = new Date();
const newStandardDateFormatting = new Date("March 16, 2030 14:25:00");
console.log("date: ", date); //! Sat Mar 16 2030 14:25:00 GMT+0200 (Восточная Европа, стандартное время)
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . .");

//? Формат виведення:
const options = {
    weekday: 'long',
    year: 'numeric',
    month: 'short',
    day: 'numeric',
    hour: '2-digit',
    minute: '2-digit',
};

//! Україна
const localeUk = newStandardDateFormatting.toLocaleString('Uk-uk', options);
console.log("localeUk_Україна:", localeUk); //! суботу, 16 бер. 2030 р., 14:25
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . .");

//! USA
const localeUs = newStandardDateFormatting.toLocaleString('en-US', options);
console.log("localeUs_Україна:", localeUs); //! Saturday, Mar 16, 2030, 02:25 PM
console.log("-------------------------------------------------------------------------------------------");


//! Вимірювання часу за допомогою new Date()
console.warn("Вимірювання часу за допомогою new Date():");
//? ✴️ Для вимірювання часу можна використовувати
//? екземпляр класу new Date():
const start1 = new Date(); //todo: Початок вимірювання часу
console.log("start1:", start1);
console.log("start1:",typeof start1);
console.log("+start1:", +start1);
console.log("start1:",typeof +start1);


//todo: процес виконання циклу
for (let i = 0; i < 100000; i++) {
    let doSomething1 = i * i * i;
    // console.log("doSomething1:", doSomething1); //!
};

const end1 = new Date(); //todo: Кінець вимірювання часу
console.log("end1:", end1);
console.log("+end1:", +end1);

//? ---------------- пригадаємо ----------------
console.log(`"9" - "6" = ${"9" - "6"}`); //! 3
//? --------------------------------------------

//todo: Результат вимірювання часу
// alert(`Цикл-1 зайняв ${end1 - start1} мс`);
console.log(`Цикл-1 зайняв ${end1 - start1} мс`);
console.log("---------------------------------------------------------------------------");

//! Вимірювання часу за допомогою Date.now()
console.warn("Вимірювання часу за допомогою Date.now():");
//? ✴️ Для вимірювання часу краще використовувати
//? спеціальний метод Date.now(),
//? що повертає поточний timestamp:
const start2 = Date.now(); //todo: Початок вимірювання часу
console.log("start2:", start2);


//todo: Процес виконання циклу
for (let i = 0; i < 100000; i++) {
    let doSomething2 = i * i * i;
    // console.log("doSomething2:", doSomething2); //!
};

const end2 = Date.now(); //todo: Кінець вимірювання часу
console.log("end2:", end2);

//todo: Результат вимірювання часу
// alert(`Цикл-2 зайняв ${end1 - end1} мс`);
console.log(`Цикл-2 зайняв ${end2 - start2} мс`);
console.log("---------------------------------------------------------------------------");


//todo: Завдання-1 (task-1)
//* Завдання: "Таймер зворотного відліку від майбутньої дати".
//? Створи плагін налаштовуваного таймера, який веде зворотний відлік
//? до попередньо визначеної дати.
//? Такий плагін може використовуватися в блогах і інтернет-магазинах
//? та на сторінках реєстрації подій, під час технічного обслуговування і т. д.

//? HTML-розмітка має інпут для введення майбутньої дати:
//! <label class="input-label">
//!     Введіть майбутню дату<i>(більше від сьогоднішньої дати на 1 день)</i> :
//!     <input id="target-date" type="datetime-local">
//! </label>

//? Плагін очікує наступну HTML-розмітку і показує чотири цифри:
//? дні,
//? години,
//? хвилини
//? секунди
//? в форматі XX:XX:XX:XX.
//? Кількість днів може складатися з більш ніж двох цифр.
//!<div class="timer" id="timer-1">
//!    <div class="field">
//!        <span class="label">Days</span>
//!        <span class="value" data-value="days">--</span>
//!
//!    </div>
//!    <div class="field">
//!        <span class="label">Hours</span>
//!        <span class="value" data-value="hours">--</span>
//!    </div>
//!    <div class="field">
//!        <span class="label">Minutes</span>
//!        <span class="value" data-value="mins">--</span>
//!    </div>
//!    <div class="field">
//!        <span class="label">Seconds</span>
//!        <span class="value" data-value="secs">--</span>
//!
//!    </div>
//!</div>

//? Плагін — це клас CountdownTimer,
//? екземпляр якого створює новий таймер з налаштуваннями:
//! new CountdownTimer({
//!     selector: '#timer-1',
//!     targetDate: new Date('Jul 17, 2019'),
//! });

//? Для підрахунку значень використовуй такі готові формули,
//? де time — різниця між targetDate і поточною датою nowDate:
/*
 * Дні, що залишилися: ділимо значення UTC на 1000 * 60 * 60 * 24, кількість
 * мілісекунд в один день (мілісекунди * секунди * хвилини * години)
 */
const days = Math.floor(time / (1000 * 60 * 60 * 24));

/*
 * Решта годин: отримуємо залишок від попереднього розрахунку за допомогою оператора
 * залишку% і ділимо його на кількість мілісекунд в одній годині
 * (1000 * 60 * 60 = мілісекунди * хвилини * секунди)
 */
const hours = Math.floor((time % (1000 * 60 * 60 * 24)) / (1000 * 60 * 60));

/*
 * Решта хвилин: отримуємо хвилини, що залишилися і ділимо їх на кількість
 * мілісекунд в одній хвилині (1000 * 60 = мілісекунди * секунди)
 */
const mins = Math.floor((time % (1000 * 60 * 60)) / (1000 * 60));

/*
 * Решта секунд: отримуємо секунди, які залишилися і ділимо їх на кількість
 * миллисекунд в одной секунде (1000)
 */
const secs = Math.floor((time % (1000 * 60)) / 1000);
